export const GAME_CONFIG = {
  MIN_NUMBER: 1,
  MAX_NUMBER: 100,
  STORAGE_KEY: 'guessGameRecord'
};

export const MESSAGES = {
  START: 'Введіть число та натисніть "Перевірити"',
  TOO_HIGH: 'Занадто високо! Спробуйте менше число 📉',
  TOO_LOW: 'Занадтоa низько! Спробуйте більше число 📈',
  WIN: '🎉 Вітаю! Ви вгадали число',
  INVALID: 'Введіть число від 1 до 100',
  VERY_CLOSE: '🔥 Дуже близько! Ще трошки',
  CLOSE: '🌡️ Тепло! Ви близько',
  FAR: '❄️ Холодно! Ви далеко'
};

export const DISTANCE = {
  VERY_CLOSE: 5,
  CLOSE: 15
};